import { FC, type ReactNode } from 'react';

import BlockTitle from '@modules/common/components/BlockTitle';
import IconFrame from '@modules/common/components/IconFrame';
import SplitBlocks from '@modules/common/components/SplitBlocks';
import { advantagesList } from '@modules/home/components/About/data';

import s from './About.module.scss';

const About: FC<{
	children?: ReactNode;
}> = ({ children }) => {
	return (
		<section id="about">
			<SplitBlocks title={`ПОПЕРЕДЖЕННЯ`} titleType="text">
				<p>
					ТОВ «ЛАЙТ ФІНАНС», код ЄДРПОУ 43580874 (далі – Товариство) надає єдиний вид
					фінансової послуги: надання коштів та банківських металів у кредит, на
					підставі ліцензії на діяльність фінансової компанії.
				</p>

				<p>ПОПЕРЕДЖЕННЯ, ЩОДО НАДАННЯ ФІНАНСОВИХ ПОСЛУГ:</p>
				<ul>
					<li>
						<p>
							Товариство не надає фінансові послуги фізичним особам. Клієнтами
							Товариства можуть бути або юридичні особи та/або фізичні особи –
							підприємці.
						</p>
					</li>
					<li>
						<p>Товариство не надає споживчі кредити.</p>
					</li>
					<li>
						<p>
							Товариство не здійснює врегулювання простроченої заборгованості
							споживачів.
						</p>
					</li>
				</ul>
			</SplitBlocks>

			<BlockTitle title="Про компанію" />

			<ul className={s.advantages}>
				{advantagesList.map((item) => (
					<li className={s.advantagesItem} key={item.desc}>
						<IconFrame icon={item.icon} />
						<p className={s.advantagesDesc}>{item.desc}</p>
					</li>
				))}
			</ul>

			<SplitBlocks title={`Про ТОВ «ЛАЙТ ФІНАНС»`} titleType="text">
				<p>
					Товариство є небанківською фінансовою установою (фінансовою компанією),
					інформація про яку внесена до Державного реєстру фінансових установ, який
					веде Національний банк України, має Свідоцтво про реєстрацію фінансової
					установи серії ФК №В0000140 від 18.01.2021.
				</p>
				<p>
					{' '}
					Національний банк України ліцензії Товариства, які 11.06.2020 були видані
					Товариству (на надання коштів у позику, в тому числі і на умовах
					фінансового кредиту; на надання послуг з факторингу; на надання послуг з
					фінансового лізингу) 26.03.2024 переоформив на ліцензію на діяльність
					фінансової компанії з правом надання видів фінансових послуг: надання
					коштів та банківських металів у кредит; факторинг; фінансовий лізинг. На
					підставі заяви Товариства, 13.11.2024 Комітет з питань нагляду та
					регулювання діяльності ринків небанківських фінансових послуг Національного
					банку України прийняв рішення про надання погодження ТОВ «ЛАЙТ ФІНАНС»
					зміни обсягу ліцензії (звуження) на діяльність фінансової компанії та
					виключення з такої ліцензії фінансових послуг: факторинг, фінансовий
					лізинг.
				</p>

				<p>
					<strong>
						{' '}
						Товариство надає єдиний вид фінансової послуги: надання коштів та
						банківських металів у кредит.
					</strong>
				</p>
				<p>
					Ідентифікаційний код юридичної особи: <strong>43580874</strong>
				</p>

				<p>
					Місцезнаходження юридичної особи:{' '}
					<strong>Україна, 03056, місто Київ, вул. Борщагівська, буд. 154</strong>
				</p>
				<p>
					Керівник - <strong>Дума Віктор Олександрович</strong>
				</p>
				<p>
					Звертатися з отримання фінансових послуг можете за адресою:{' '}
					<strong>Україна, 03056, місто Київ, вул.Борщагівська, будинок 154</strong>{' '}
					або за телефоном <strong>+38(091)-481-88-39</strong>
				</p>

				<p style={{ border: '1px solid black', padding: '10px' }}>
					<strong>
						ТОВ «ЛАЙТ ФІНАНС» не здійснює надання коштів та банківських металів у
						кредит фізичним особам-споживачам та/або врегулювання простроченої
						заборгованості з фізичними особами - споживачами фінансових послуг.
					</strong>
				</p>
			</SplitBlocks>

			{children}
		</section>
	);
};

export default About;
