import {FC, type ReactNode} from 'react';

import BlockTitle from '@modules/common/components/BlockTitle';
import IconFrame from '@modules/common/components/IconFrame';
import SplitBlocks from '@modules/common/components/SplitBlocks';
import {advantagesList} from '@modules/home/components/About/data';

import s from './About.module.scss';

const About: FC<{
	children?: ReactNode;
}> = ({children}) => {
	return (
		<section id="about">
			<SplitBlocks
				title={`ПОПЕРЕДЖЕННЯ`}
				titleType="text"
			>
				<p> ТОВ «ЛАЙТ ФІНАНС», код ЄДРПОУ 43580874 (далі – Товариство), у
					зв’язку з переоформленням 26.03.2024 Національним банком України
					ліцензій, Товариству видана ліцензія на діяльність фінансової компанії
					з правом надання видів фінансових послуг:
				</p>
				<ul>
					<li><p>надання коштів та банківських металів у кредит;</p></li>
					<li><p>факторинг;</p></li>
					<li><p>фінансовий лізинг.</p></li>
				</ul>

				<p>ПОПЕРЕДЖЕННЯ, ЩОДО НАДАННЯ ФІНАНСОВИХ ПОСЛУГ:</p>
				<ul>
					<li><p>Товариство не надає фінансові послуги фізичним особам.
						Клієнтами
						Товариства можуть бути або юридичні особи та/або фізичні особи –
						підприємці.</p></li>
					<li><p>Товариство не надає споживчі кредити.</p></li>
					<li><p>Товариство не здійснює врегулювання простроченої заборгованості
						споживачів.</p></li>
				</ul>
			</SplitBlocks>

			<BlockTitle title="Про компанію"/>

			<ul className={s.advantages}>
				{advantagesList.map((item) => (
					<li className={s.advantagesItem} key={item.desc}>
						<IconFrame icon={item.icon}/>
						<p className={s.advantagesDesc}>{item.desc}</p>
					</li>
				))}
			</ul>

			<SplitBlocks
				title={`Про ТОВ «ЛАЙТ ФІНАНС»`}
				titleType="text"
			>
				<p>Товариство є небанківською фінансовою установою (фінансовою
					компанією), інформація про яку внесена до Державного реєстру
					фінансових установ, який веде Національний банк України, має Свідоцтво
					про реєстрацію фінансової установи серії ФК №В0000140 від 18.01.2021.
				</p>
				<p> Національний банк України ліцензії Товариства, які були видані
					Товариству 11.06.2020: на надання коштів у позику, в тому числі і на
					умовах фінансового кредиту; на надання послуг з факторингу; на надання
					послуг з фінансового лізингу, 26.03.2024 переоформив на ліцензію на
					діяльність фінансової компанії з правом надання видів фінансових
					послуг:</p>

				<ul>
					<li>надання коштів та банківських металів у кредит;</li>
					<li>факторинг;</li>
					<li>фінансовий лізинг.</li>
				</ul>

				<p>
					Ідентифікаційний код юридичної особи: 43580874
					<br/>
					Місцезнаходження юридичної особи: Україна, 03056, місто Київ, вул.
					Борщагівська, буд. 154
					<br/>
					Керівник - Дума Віктор Олександрович
					<br/>
					Звертатися з отримання фінансових послуг можете за адресою: Україна,
					03056,
					місто Київ, вул.Борщагівська, будинок 154 або за телефоном
					+38(091)-481-88-39
				</p>
				<p>
					<strong>ТОВ «ЛАЙТ ФІНАНС» </strong>
					не здійснює надання фінансових послуг фізичним особам, а саме не
					здійснює
					надання коштів у кредит та/або надання послуг факторингу та/або
					надання
					послуг фінансового лізингу фізичним особам-споживачам та/або
					врегулювання
					простроченої заборгованості з фізичними-особами споживачами фінансових
					послуг.
				</p>
			</SplitBlocks>

			{children}
		</section>
	);
};

export default About;
