import BlockTitle from '@modules/common/components/BlockTitle';
import SplitBlocks from '@modules/common/components/SplitBlocks';

import { importDoc } from '@utils/formatters';

const ReportViolation = () => {
	return (
		<section id="report-violation">
			<BlockTitle title="Повідомити про порушення" />

			<SplitBlocks
				title="ТОВ «ЛАЙТ ФІНАНС» впровадила систему інформування працівників та третіх осіб про порушення вимог законодавства щодо фінансового моніторингу."
				titleType="text"
			>
				<p>
					З метою виконання вимог Закону України «Про запобігання та протидію
					легалізації (відмиванню) доходів, одержаних злочинним шляхом, фінансуванню
					тероризму та фінансуванню розповсюдження зброї масового знищення» (від
					06.12.2019 №361-IX) ТОВ «ЛАЙТ ФІНАНС» (далі – Установа) впровадила систему
					інформування працівниками Установи та третіми особами (анонімно або із
					зазначенням авторства) Відповідального працівника Установи за проведення
					фінансового моніторингу про можливі порушення вимог законодавства у цій
					сфері (ПВК/ФТ*).
				</p>

				<p>
					У разі, якщо Вам стало відомо про факти таких порушень Установою, окремими
					працівниками Установи, Ви можете повідомити про відомі Вам факти в один із
					наступних способів:
				</p>

				<p>
					1. Заповнити форму{' '}
					<a
						href={importDoc('povidomlennia_pro_porushennia.pdf')}
						target="_blank"
						rel="noreferrer"
					>
						повідомлення про порушення
					</a>{' '}
					та надіслати на електронну пошту{' '}
					<a href="mailto:fm@litefinance.com.ua" target="_blank" rel="noreferrer">
						fm@litefinance.com.ua
					</a>
				</p>

				<p>
					2. Заповнити форму{' '}
					<a
						href={importDoc('povidomlennia_pro_porushennia.pdf')}
						target="_blank"
						rel="noreferrer"
					>
						повідомлення про порушення
					</a>{' '}
					та надіслати на поштову адресу Установи, яка зазначена на сайті у розділі
					«Контакти»
				</p>

				<p>
					3. Заповнити форму{' '}
					<a
						href={importDoc('povidomlennia_pro_porushennia.pdf')}
						target="_blank"
						rel="noreferrer"
					>
						повідомлення про порушення
					</a>{' '}
					у приміщенні Установи та надати у вигляді офіційного звернення до керівника
					Установи та/або Відповідального працівника Установи за проведення
					фінансового моніторингу
				</p>

				<p>
					4. Записатись на особисту зустріч з керівником Установи та/або
					Відповідальним працівником Установи за проведення фінансового моніторингу
					(не для анонімних повідомлень)
				</p>

				<p>5. Зателефонувати за номером +38(091)481-88-39</p>

				<p>
					{' '}
					*ПВК/ФТ – запобігання та протидія легалізації (відмиванню) доходів,
					одержаних злочинним шляхом, фінансуванню тероризму та фінансуванню
					розповсюдження зброї масового знищення
				</p>
			</SplitBlocks>
		</section>
	);
};

export default ReportViolation;
